In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.11/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
marks = [23,34,2,3,2,4]
s1 = pd.Series(marks)
print(s1)

0    23
1    34
2     2
3     3
4     2
5     4
dtype: int64

In [6]:
marks = [23,34,2,3,2,4]
s1 = pd.Series(marks , index = ["rohn" , "manish","aryan","dipesh","sunil","jack"])
print(s1)
print(s1["rohn"])

rohn      23
manish    34
aryan      2
dipesh     3
sunil      2
jack       4
dtype: int64
23

In [9]:
marks = {
    "maths" : [41,43,23,22],
    "english" : [34,23,45,23]
}

In [10]:
df = pd.DataFrame(marks)

In [11]:
df

   maths  english
0     41       34
1     43       23
2     23       45
3     22       23

In [12]:
df_2 = pd.DataFrame(marks , index = ["rohan","aryan","manish","sudhir"])

In [13]:
df_2

        maths  english
rohan      41       34
aryan      43       23
manish     23       45
sudhir     22       23

In [14]:
df_2.loc["rohan"]

maths      41
english    34
Name: rohan, dtype: int64

In [16]:
df.loc[0]

maths      41
english    34
Name: 0, dtype: int64

In [31]:
df_csv = pd.read_csv("./username.csv" , delimiter=";")

In [33]:
df_csv

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith